test/fixtures/xml/stamps/get_rates_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:tns="http://stamps.com/xml/namespace/2013/10/swsim/swsimv33">
  <soap:Body>
    <tns:GetRates>
      <tns:Authenticator>***authenticator***</tns:Authenticator>
      <tns:Rate>
        <tns:FromZIPCode>90405</tns:FromZIPCode>
        <tns:ToZIPCode>90066</tns:ToZIPCode>
        <tns:WeightLb>12</tns:WeightLb>
        <tns:PackageType>Package</tns:PackageType>
        <tns:ShipDate>2009-08-31</tns:ShipDate>
        <tns:InsuredValue>100.00</tns:InsuredValue>
      </tns:Rate>
    </tns:GetRates>
  </soap:Body>
</soap:Envelope>
